import numpy as np
import pandas as pd
from tensorflow.keras.preprocessing.text import Tokenizer

text = '나는 지금 진짜 진짜 매우 매우 맛있는 김밥을 엄청 마구 마구 마구 마구 먹었다.'
# text = '블라 블라 블라 블라 블라 블라 후루룩 후루룩 라면 찹찹 치킨 바삭 바삭해 아이 좋아 치킨 좋아'

token = Tokenizer() #클래스에서 정의된 변수는 instance라고 한다. 즉 instance를 생성했다고 한다.  
token.fit_on_texts([text])

print(token.word_index) #{'마구': 1, '진짜': 2, '매우': 3, '나는': 4, '지금': 5, '맛있는': 6, '김밥을': 7, '엄청': 8, '먹었다': 9}

print(token.word_counts) #OrderedDict([('나는', 1), ('지금', 1), ('진짜', 2), ('매우', 2), ('맛있는', 1), ('김밥을', 1), ('엄청', 1), ('마구', 5), ('먹었다', 1)])    

x = token.texts_to_sequences([text])
# print(x) [[4, 5, 2, 2, 3, 3, 6, 7, 8, 1, 1, 1, 1, 1, 9]]

# print(len(x[0])) #15

# 원핫 인코딩은 y에서만 하는 것이 아닌 x에서도 해줘야 한다.

#### 원핫 3가지 맹그러봐!!! ###
# 1부터 시작하는 함정이 있다! 주의! 

# from tensorflow.keras.utils import to_categorical
# x = to_categorical(x, num_classes=10) #num_classes를 기존 컬럼보다 낮게 주면 안된다.
# x = x[:, :, 1:]
# x = np.reshape(x, (14, 9))
# print(x.shape)
# print(x)

# [[0. 0. 0. 1. 0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 1. 0. 0. 0. 0.]
#  [0. 1. 0. 0. 0. 0. 0. 0. 0.]
#  [0. 1. 0. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 1. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 1. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 0. 1. 0. 0. 0.]
#  [0. 0. 0. 0. 0. 0. 1. 0. 0.]
#  [0. 0. 0. 0. 0. 0. 0. 1. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 0. 0. 0. 0. 1.]]


x = pd.get_dummies(np.array(x).reshape(-1,)) 
print(x)
print(x.shape)
#     1  2  3  4  5  6  7  8  9
# 0   0  0  0  1  0  0  0  0  0
# 1   0  0  0  0  1  0  0  0  0
# 2   0  1  0  0  0  0  0  0  0
# 3   0  1  0  0  0  0  0  0  0
# 4   0  0  1  0  0  0  0  0  0
# 5   0  0  1  0  0  0  0  0  0
# 6   0  0  0  0  0  1  0  0  0
# 7   0  0  0  0  0  0  1  0  0
# 8   0  0  0  0  0  0  0  1  0
# 9   1  0  0  0  0  0  0  0  0
# 10  1  0  0  0  0  0  0  0  0
# 11  1  0  0  0  0  0  0  0  0
# 12  1  0  0  0  0  0  0  0  0
# 13  0  0  0  0  0  0  0  0  1


# #사이킷런 선생님꺼 
# from sklearn.preprocessing import OneHotEncoder
# x = np.reshape(x, (-1,1))
# ohe = OneHotEncoder(sparse=False) #True가 디폴트
# x = ohe.fit_transform(x)
# print(x)
# print(x.shape)

# # [[0. 0. 0. 1. 0. 0. 0. 0. 0.]
# #  [0. 0. 0. 0. 1. 0. 0. 0. 0.]
# #  [0. 1. 0. 0. 0. 0. 0. 0. 0.]
# #  [0. 1. 0. 0. 0. 0. 0. 0. 0.]
# #  [0. 0. 1. 0. 0. 0. 0. 0. 0.]
# #  [0. 0. 1. 0. 0. 0. 0. 0. 0.]
# #  [0. 0. 0. 0. 0. 1. 0. 0. 0.]
# #  [0. 0. 0. 0. 0. 0. 1. 0. 0.]
# #  [0. 0. 0. 0. 0. 0. 0. 1. 0.]
# #  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
# #  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
# #  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
# #  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
# #  [0. 0. 0. 0. 0. 0. 0. 0. 1.]]